app/Views/absensi/admin/dashboard.php


$kehadiranModel = new AbsensiKehadiran();
$keluarModel = new AbsensiKeluar();
$dataHadir = $kehadiranModel->where('DATE(tanggal)', date('Y-m-d'))->join('mahasiswa', 'kehadiran.idmhs = mahasiswa.idmhs', 'inner')->findAll();
$dataKeluar = $keluarModel->where('DATE(tanggal)', date('Y-m-d'))->join('mahasiswa', 'keluar.idmhs = mahasiswa.idmhs', 'inner')->findAll();
---
SELECT *
FROM `kehadiran`
INNER JOIN `mahasiswa` ON `kehadiran`.`idmhs` = `mahasiswa`.`idmhs`
WHERE DATE(tanggal) = '2024-05-02'
SELECT *
FROM `keluar`
INNER JOIN `mahasiswa` ON `keluar`.`idmhs` = `mahasiswa`.`idmhs`
WHERE DATE(tanggal) = '2024-05-02'

                </div>
                <div class="body-dates" id="datesContainer" hidden>
                    <?php
                    $dates = $kehadiranModel->distinct()->select('DATE(tanggal) as tanggal')->findAll();
---
SELECT DISTINCT DATE(tanggal) as tanggal
FROM `kehadiran`