app/Views/cms/layouts/modalAddPhoto.php

                <select name="idportfolio" id="website">
                    <?php
                    $FotoModel = new \App\Models\Portofolio();
                    $data = $FotoModel->findAll();
---
SELECT *
FROM `portofolio`