app/Views/cms/layouts/modalDetail.php

SELECT *
FROM `foto`
WHERE `idportofolio` = '1'
---
                        <tbody>
                            <?php
                            $FotoModel = new \App\Models\Foto();
                            $data = $FotoModel->where('idportofolio', session('idportofolio'))->findAll();