app/Views/cms/dashboard.php

                    <tbody>
                        <?php
                        $modelKontak = new \App\Models\Kontak();
                        $data = $modelKontak->findAll();
---
SELECT *
FROM `kontak`