app/Views/cms/photo.php

                    <tbody>
                        <?php
                        $modelFoto = new \App\Models\Foto();
                        $data = $modelFoto->select('*')->distinct()->join('portofolio', 'portofolio.idportofolio = foto.idportofolio', 'inner')->groupBy('foto.idportofolio')->findAll();
---
SELECT DISTINCT *
FROM `foto`
INNER JOIN `portofolio` ON `portofolio`.`idportofolio` = `foto`.`idportofolio`
GROUP BY `foto`.`idportofolio`