app/Views/cms/portfolio.php

SELECT *
FROM `portofolio`
---
                    <tbody>
                        <?php
                        $modelPortofolio = new \App\Models\Portofolio();
                        $data = $modelPortofolio->findAll();