app/Controllers/AbsensiController.php

SELECT *
FROM `akun`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function loginAction()
    {
        session()->set('LOGGED_IN', false);
        $username = session()->getFlashdata('username');
        $password = strval(session()->getFlashdata('password'));

        if (empty($username) || empty($password)) {
            session()->setFlashdata('error', 'Nama pengguna dan kata sandi diperlukan');
            return redirect()->back();
        }

        $userCheck = null;
        $userCheck = $this->akunModel->where('username', $username)->first();